xcweaver/socialnetwork/evaluation/local/2024-05-02_15:57:22_workload.txt
Running 30s test @ http://localhost:9000/wrk2-api/post/compose
  2 threads and 2 connections
  Thread calibration: mean lat.: 40.244ms, rate sampling interval: 193ms
  Thread calibration: mean lat.: 31.256ms, rate sampling interval: 113ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    50.20ms   54.74ms 343.55ms   94.00%
    Req/Sec    24.19     12.04    53.00     72.04%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   35.90ms
 75.000%   57.15ms
 90.000%   83.46ms
 99.000%  343.55ms
 99.900%  443.65ms
 99.990%  448.77ms
 99.999%  448.77ms
100.000%  448.77ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      13.471     0.000000            1         1.00
      17.679     0.100000           99         1.11
      20.831     0.200000          197         1.25
      24.975     0.300000          296         1.43
      29.503     0.400000          394         1.67
      35.903     0.500000          492         2.00
      39.071     0.550000          543         2.22
      42.783     0.600000          591         2.50
      47.135     0.650000          640         2.86
      52.223     0.700000          689         3.33
      57.151     0.750000          738         4.00
      60.063     0.775000          763         4.44
      63.007     0.800000          788         5.00
      66.495     0.825000          812         5.71
      72.383     0.850000          837         6.67
      76.863     0.875000          861         8.00
      79.807     0.887500          874         8.89
      83.455     0.900000          887        10.00
      86.655     0.912500          898        11.43
      92.415     0.925000          911        13.33
     103.935     0.937500          923        16.00
     109.375     0.943750          929        17.78
     117.631     0.950000          935        20.00
     129.343     0.956250          941        22.86
     132.863     0.962500          948        26.67
     147.839     0.968750          954        32.00
     167.935     0.971875          957        35.56
     213.887     0.975000          960        40.00
     243.967     0.978125          963        45.71
     298.495     0.981250          966        53.33
     321.791     0.984375          969        64.00
     329.983     0.985938          971        71.11
     331.263     0.987500          972        80.00
     343.551     0.989062          974        91.43
     351.487     0.990625          975       106.67
     394.239     0.992188          977       128.00
     408.063     0.992969          978       142.22
     408.063     0.993750          978       160.00
     412.671     0.994531          979       182.86
     423.679     0.995313          980       213.33
     425.471     0.996094          981       256.00
     425.471     0.996484          981       284.44
     425.471     0.996875          981       320.00
     432.895     0.997266          982       365.71
     432.895     0.997656          982       426.67
     443.647     0.998047          983       512.00
     443.647     0.998242          983       568.89
     443.647     0.998437          983       640.00
     443.647     0.998633          983       731.43
     443.647     0.998828          983       853.33
     448.767     0.999023          984      1024.00
     448.767     1.000000          984          inf
#[Mean    =       50.199, StdDeviation   =       54.742]
#[Max     =      448.512, Total count    =          984]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1505 requests in 30.00s, 621.37KB read
Requests/sec:     50.16
Transfer/sec:     20.71KB
