xcweaver/socialnetwork/evaluation/local/2024-05-02_17:59:18_workload.txt
Running 30s test @ http://localhost:9000/wrk2-api/post/compose
  2 threads and 2 connections
  Thread calibration: mean lat.: 31.772ms, rate sampling interval: 93ms
  Thread calibration: mean lat.: 46.702ms, rate sampling interval: 186ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    46.52ms   38.63ms 194.30ms   87.10%
    Req/Sec    24.17     12.75    54.00     62.93%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   32.64ms
 75.000%   54.72ms
 90.000%   99.52ms
 99.000%  194.30ms
 99.900%  236.67ms
 99.990%  240.64ms
 99.999%  240.64ms
100.000%  240.64ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      12.647     0.000000            1         1.00
      16.607     0.100000           99         1.11
      18.847     0.200000          196         1.25
      22.175     0.300000          294         1.43
      27.055     0.400000          391         1.67
      32.639     0.500000          489         2.00
      35.871     0.550000          538         2.22
      39.615     0.600000          588         2.50
      43.583     0.650000          636         2.86
      49.215     0.700000          684         3.33
      54.719     0.750000          733         4.00
      60.031     0.775000          758         4.44
      66.239     0.800000          782         5.00
      73.023     0.825000          808         5.71
      79.039     0.850000          832         6.67
      86.015     0.875000          855         8.00
      92.415     0.887500          868         8.89
     100.031     0.900000          881        10.00
     106.111     0.912500          892        11.43
     114.943     0.925000          904        13.33
     123.519     0.937500          916        16.00
     130.175     0.943750          923        17.78
     131.967     0.950000          929        20.00
     134.015     0.956250          935        22.86
     140.415     0.962500          941        26.67
     147.839     0.968750          947        32.00
     156.415     0.971875          950        35.56
     159.743     0.975000          953        40.00
     162.687     0.978125          956        45.71
     167.551     0.981250          959        53.33
     178.559     0.984375          962        64.00
     180.735     0.985938          964        71.11
     187.647     0.987500          965        80.00
     194.303     0.989062          967        91.43
     205.183     0.990625          968       106.67
     209.151     0.992188          970       128.00
     209.791     0.992969          971       142.22
     209.791     0.993750          971       160.00
     212.095     0.994531          972       182.86
     221.183     0.995313          973       213.33
     224.255     0.996094          974       256.00
     224.255     0.996484          974       284.44
     224.255     0.996875          974       320.00
     233.727     0.997266          975       365.71
     233.727     0.997656          975       426.67
     236.671     0.998047          976       512.00
     236.671     0.998242          976       568.89
     236.671     0.998437          976       640.00
     236.671     0.998633          976       731.43
     236.671     0.998828          976       853.33
     240.639     0.999023          977      1024.00
     240.639     1.000000          977          inf
#[Mean    =       46.519, StdDeviation   =       38.635]
#[Max     =      240.512, Total count    =          977]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1505 requests in 30.00s, 621.39KB read
Requests/sec:     50.17
Transfer/sec:     20.71KB
