xcweaver/socialnetwork/evaluation/local/2024-05-22_14:26:50_workload.txt
Running 30s test @ http://localhost:9000/wrk2-api/post/compose
  2 threads and 2 connections
  Thread calibration: mean lat.: 31.823ms, rate sampling interval: 87ms
  Thread calibration: mean lat.: 38.582ms, rate sampling interval: 212ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    44.36ms   32.24ms 163.97ms   86.37%
    Req/Sec    24.09     12.68    51.00     78.64%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   34.65ms
 75.000%   55.87ms
 90.000%   83.97ms
 99.000%  163.97ms
 99.900%  251.90ms
 99.990%  263.42ms
 99.999%  263.42ms
100.000%  263.42ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      12.911     0.000000            1         1.00
      17.471     0.100000           98         1.11
      19.871     0.200000          196         1.25
      22.975     0.300000          293         1.43
      28.367     0.400000          391         1.67
      34.655     0.500000          489         2.00
      38.335     0.550000          537         2.22
      42.015     0.600000          586         2.50
      45.567     0.650000          635         2.86
      50.559     0.700000          684         3.33
      55.871     0.750000          732         4.00
      59.263     0.775000          757         4.44
      63.935     0.800000          781         5.00
      69.247     0.825000          806         5.71
      73.727     0.850000          830         6.67
      78.335     0.875000          854         8.00
      80.511     0.887500          867         8.89
      84.031     0.900000          879        10.00
      87.487     0.912500          892        11.43
      92.159     0.925000          903        13.33
      96.895     0.937500          915        16.00
     103.295     0.943750          922        17.78
     106.751     0.950000          928        20.00
     109.439     0.956250          934        22.86
     113.279     0.962500          940        26.67
     116.287     0.968750          946        32.00
     117.631     0.971875          949        35.56
     120.447     0.975000          952        40.00
     127.871     0.978125          955        45.71
     130.111     0.981250          958        53.33
     147.071     0.984375          961        64.00
     150.399     0.985938          963        71.11
     157.567     0.987500          964        80.00
     163.967     0.989062          966        91.43
     171.775     0.990625          967       106.67
     174.847     0.992188          969       128.00
     175.487     0.992969          970       142.22
     175.487     0.993750          970       160.00
     189.055     0.994531          971       182.86
     225.407     0.995313          972       213.33
     239.231     0.996094          973       256.00
     239.231     0.996484          973       284.44
     239.231     0.996875          973       320.00
     244.223     0.997266          974       365.71
     244.223     0.997656          974       426.67
     251.903     0.998047          975       512.00
     251.903     0.998242          975       568.89
     251.903     0.998437          975       640.00
     251.903     0.998633          975       731.43
     251.903     0.998828          975       853.33
     263.423     0.999023          976      1024.00
     263.423     1.000000          976          inf
#[Mean    =       44.357, StdDeviation   =       32.238]
#[Max     =      263.168, Total count    =          976]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1505 requests in 30.00s, 621.37KB read
Requests/sec:     50.16
Transfer/sec:     20.71KB
