xcweaver/socialnetwork/evaluation/local/2024-05-22_14:27:50_workload.txt
Running 30s test @ http://localhost:9000/wrk2-api/post/compose
  2 threads and 2 connections
  Thread calibration: mean lat.: 45.091ms, rate sampling interval: 199ms
  Thread calibration: mean lat.: 33.505ms, rate sampling interval: 124ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    30.75ms   20.23ms 123.39ms   88.81%
    Req/Sec    24.42     12.63    56.00     67.43%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   23.65ms
 75.000%   36.32ms
 90.000%   52.70ms
 99.000%  123.39ms
 99.900%  149.25ms
 99.990%  165.25ms
 99.999%  165.25ms
100.000%  165.25ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      13.231     0.000000            1         1.00
      15.695     0.100000           99         1.11
      17.487     0.200000          195         1.25
      18.991     0.300000          293         1.43
      20.655     0.400000          390         1.67
      23.647     0.500000          487         2.00
      25.743     0.550000          536         2.22
      27.551     0.600000          585         2.50
      30.415     0.650000          634         2.86
      33.087     0.700000          682         3.33
      36.319     0.750000          731         4.00
      38.527     0.775000          756         4.44
      40.639     0.800000          780         5.00
      42.591     0.825000          804         5.71
      45.279     0.850000          829         6.67
      48.543     0.875000          853         8.00
      50.879     0.887500          865         8.89
      52.703     0.900000          877        10.00
      54.623     0.912500          889        11.43
      57.343     0.925000          901        13.33
      62.207     0.937500          914        16.00
      64.575     0.943750          920        17.78
      67.775     0.950000          926        20.00
      69.759     0.956250          932        22.86
      75.775     0.962500          938        26.67
      80.703     0.968750          944        32.00
      86.271     0.971875          947        35.56
      88.127     0.975000          950        40.00
      93.823     0.978125          953        45.71
      95.103     0.981250          956        53.33
     109.631     0.984375          959        64.00
     117.631     0.985938          961        71.11
     119.807     0.987500          962        80.00
     123.391     0.989062          964        91.43
     125.247     0.990625          965       106.67
     130.495     0.992188          967       128.00
     133.375     0.992969          968       142.22
     133.375     0.993750          968       160.00
     136.575     0.994531          969       182.86
     143.999     0.995313          970       213.33
     144.383     0.996094          971       256.00
     144.383     0.996484          971       284.44
     144.383     0.996875          971       320.00
     147.327     0.997266          972       365.71
     147.327     0.997656          972       426.67
     149.247     0.998047          973       512.00
     149.247     0.998242          973       568.89
     149.247     0.998437          973       640.00
     149.247     0.998633          973       731.43
     149.247     0.998828          973       853.33
     165.247     0.999023          974      1024.00
     165.247     1.000000          974          inf
#[Mean    =       30.755, StdDeviation   =       20.233]
#[Max     =      165.120, Total count    =          974]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1506 requests in 30.00s, 621.77KB read
Requests/sec:     50.20
Transfer/sec:     20.73KB
